{
  "backend/main.mo": "Main actor defining GearReview, MotorcycleReview, and Vlog types with CRUD operations (add/get) for each, storing data in Maps with timestamp-based sorting and 1-5 star rating validation.",
  "backend/migration.mo": "Migration module that transforms OldActor (with only reviews Map) to NewActor (with separate gearReviews and motorcycleReviews Maps), initializing empty motorcycle reviews collection.",
  "feature_evidence.json": "Feature evidence report documenting motorcycle review functionality including submission form, listing page with search/filter/sort, detail pages, navigation updates, and homepage integration with associated files and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including components (Navigation, ReviewCard, VlogCard, forms, StarRating), pages (Home, Reviews, Vlogs, detail pages), hooks (useQueries with React Query), and configuration files.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Moto Review Hub' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Main app component with TanStack Router setup defining routes for home, reviews, videos, motorcycles, submission forms, and detail pages, wrapped in ThemeProvider with Navigation, Footer, and Toaster components.",
  "frontend/src/components/Footer.tsx": "Footer component with three-column layout displaying about section, quick links (reviews, videos, submission forms), social media icons (Facebook, X, Instagram, YouTube), copyright notice, and caffeine.ai attribution with UTM tracking.",
  "frontend/src/components/MotorcycleReviewCard.tsx": "Card component displaying motorcycle review with bike icon placeholder, year badge, star rating, model/manufacturer, truncated review text, reviewer name, and publication date with hover animations and routing to detail page.",
  "frontend/src/components/MotorcycleReviewForm.tsx": "Form component for submitting motorcycle reviews with fields for model, manufacturer, year, rating, review text, and reviewer name. Validates input, uses mutation hook to submit data, and displays toast notifications for success/error states.",
  "frontend/src/components/Navigation.tsx": "Fixed navigation bar with logo, desktop menu, mobile hamburger menu, and sponsor CTA button. Includes links to home, reviews, motorcycles, videos, and submission pages with responsive layout.",
  "frontend/src/components/ReviewCard.tsx": "Card component displaying gear review summary with image, category badge, star rating, gear name, brand, truncated review text, and metadata (reviewer, date). Links to detailed review page with hover effects.",
  "frontend/src/components/ReviewForm.tsx": "Form component for submitting gear reviews with fields for gear name, category dropdown, brand, star rating, review text, and reviewer name. Handles validation, submission via mutation hook, and form reset on success.",
  "frontend/src/components/StarRating.tsx": "Interactive star rating component supporting both readonly display and editable modes with hover effects. Renders 5 stars with configurable size and handles click/hover interactions.",
  "frontend/src/components/TagInput.tsx": "Tag input component allowing users to add/remove tags via text input with Enter key or button click. Displays tags as removable badges with validation to prevent duplicates.",
  "frontend/src/components/VideoCard.tsx": "Card component for video/vlog display with thumbnail, play button overlay, title, description, publication date, and category tags. Includes special badge for cinematics category and links to video detail page.",
  "frontend/src/components/VideoEmbed.tsx": "Video embed component that parses YouTube and Vimeo URLs to generate proper embed URLs and renders an iframe player. Shows error message for invalid URLs.",
  "frontend/src/components/VideoForm.tsx": "Form component for submitting videos with fields for title, description, URL (YouTube/Vimeo), thumbnail, category, and tags. Validates video URLs and uses React Query mutation to add videos to the backend.",
  "frontend/src/components/VlogCard.tsx": "Empty file with no content.",
  "frontend/src/components/VlogForm.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages an ICP actor instance based on Internet Identity authentication state. Automatically invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state and identity persistence using AuthClient. Provides authentication status, identity object, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating gear reviews, motorcycle reviews, and videos/vlogs. Each mutation automatically invalidates relevant queries on success.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark theme colors using a motorcycle aesthetic (orange, red, yellow accents). Defines typography styles and utility classes for motorcycle-themed colors.",
  "frontend/src/main.tsx": "Application entry point that wraps the App component with QueryClientProvider for React Query and InternetIdentityProvider for authentication.",
  "frontend/src/pages/Home.tsx": "Homepage component displaying a hero banner and featured sections for gear reviews, motorcycle reviews, and videos. Fetches data using custom hooks and provides navigation to detailed pages.",
  "frontend/src/pages/MotorcycleReviewDetail.tsx": "Displays a detailed view of a single motorcycle review with model info, rating, review text, and metadata. Includes back navigation and loading/error states.",
  "frontend/src/pages/MotorcycleReviews.tsx": "Lists all motorcycle reviews with search, sort (newest/oldest/highest rated), and filtering capabilities. Displays reviews in a responsive grid layout.",
  "frontend/src/pages/ReviewDetail.tsx": "Shows detailed gear review page with image, star rating, reviewer info, and related reviews section. Includes navigation back to reviews list.",
  "frontend/src/pages/Reviews.tsx": "Displays gear reviews with search, category filter, and sort options. Shows reviews in a grid with loading states and empty state handling.",
  "frontend/src/pages/SubmitMotorcycleReview.tsx": "Page for submitting motorcycle reviews with a centered form layout and descriptive header with bike icon.",
  "frontend/src/pages/SubmitReview.tsx": "Page for submitting gear reviews featuring a ReviewForm component with centered header and FileText icon.",
  "frontend/src/pages/SubmitVideo.tsx": "Page for submitting videos with VideoForm component, centered layout, and Video icon in header.",
  "frontend/src/pages/SubmitVlog.tsx": "Empty file with no content.",
  "frontend/src/pages/VideoPlayer.tsx": "Video player page displaying embedded video with title, category badges, publication date, tags, and description. Includes back navigation and error handling.",
  "frontend/src/pages/Videos.tsx": "Videos page component that displays a filterable grid of motorcycle videos with category tabs (all, regular, cinematics) and loading states.",
  "frontend/src/pages/VlogPlayer.tsx": "Empty file placeholder for a vlog/video player page component.",
  "frontend/src/pages/Vlogs.tsx": "Empty file placeholder for a vlogs listing page component.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom theme extensions including OKLCH color system, motorcycle brand colors (moto-orange, moto-red, etc.), custom animations, and typography plugins.",
  "project_state.json": "Project state document defining a motorcycle gear review website with video hosting, architectural notes to replace 'vlogs' with 'videos', add cinematics category, and existing features for review/vlog posting, homepage, and navigation."
}